---
title: SpatialElement
classe: Autodesk.Revit.DB.SpatialElement
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# SpatialElement

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Area { get; }` | `spatialElement.Area` | Double |
| `Level Level { get; }` | `spatialElement.Level` | Level |
| `Location Location { get; }` | `spatialElement.Location` | Location |
| `String Name { get; set; }` | `spatialElement.Name` | String |
| `String Number { get; set; }` | `spatialElement.Number` | String |
| `Double Perimeter { get; }` | `spatialElement.Perimeter` | Double |
| `SpatialElementType SpatialElementType { get; }` | `spatialElement.SpatialElementType` | SpatialElementType |
| `IList<IList<BoundarySegment>> GetBoundarySegments(SpatialElementBoundaryOptions)` | `spatialElement.GetBoundarySegments(options)` | IList<IList<BoundarySegment>> |
| `XYZ GetDefaultLocation()` | `spatialElement.GetDefaultLocation()` | XYZ |
| `SpatialElementDomainData GetSpatialElementDomainData()` | `spatialElement.GetSpatialElementDomainData()` | SpatialElementDomainData |
| `Void Recenter()` | `spatialElement.Recenter()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```